<?php

//自定义错误

include_once ROOT_PATH ."web/lib/weixin/errCode.php";
class WxError extends ErrCode{

		//自己定义的错误 全以负数-开始 如-10000 -100001
		//微信新增的,全是正数
	 public static $myErrCode=array(
	 	"45065"=>"clientmsgid重复群发",
	 	"45066"=>"相同 clientmsgid 重试速度过快，请间隔1分钟重试",
	 	"45067"=>"clientmsgid 长度超过限制",


	 	"-10001"=>'上传的图片地址不能为空',
	 	"-10002"=>'远程图片下载失败',
	 	"-10003"=>'当前图片为mediaid不是url',
	 	"-10004"=>'本地图片不存在',
	 	"-10005"=>'图片大小超过限制',
	 	"-10006"=>'缩略图不能为空',
	 	"-10007"=>'标题不能为空',
	 	"-10008"=>'内容不能为空',
	 	"-10009"=>'open_id不能为空',
	 	"-100010"=>'待下载的图片地址不能为空',
	 	"-100011"=>'缩图片图片地址不能为空',
	 	"-100012"=>'远程图片请先下载到本地后再重生成缩略图',
	 	"-100013"=>'图片不存在',
	 	"-100014"=>'生成缩略图失败,可能是目录无限制写入文件',
	 	"-100015"=>'专题所属的mediaid不能为空',
	 	"-100016"=>'要查询推送结果的ID不能为空',
	 	"-100017"=>'收到推送消息解析失败',
	 	

	 	//群发推送结果
		"news_10001"=> "涉嫌广告",
		"news_20001"=> "涉嫌政治",
		"news_20004"=> "涉嫌社会",
		"news_20002"=> "涉嫌色情",
		"news_20006"=> "涉嫌违法犯罪",
		"news_20008"=> "涉嫌欺诈",
		"news_20013"=> "涉嫌版权",
		"news_22000"=> "涉嫌互推(互相宣传)",
		"news_21000"=> "涉嫌其他",
		"news_30001"=> "原创校验出现系统错误且用户选择了被判为转载就不群发",
		"news_30002"=> "原创校验被判定为不能群发",
		"news_30003"=> "原创校验被判定为转载文且用户选择了被判为转载就不群发",
	 );

	static function check($code = 0){
        	if (isset(self::$myErrCode[$code])) {
	            return self::$myErrCode[$code];
	        }else {
	           return parent::getErrText($code);
	        }
	 }


}

?>
